armfly/H7-TOOL_STM32H7_App/User/bsp/src/bsp_uart_fifo.c
/*
*********************************************************************************************************
*
*    模块名称 : 串口中断+FIFO驱动模块
*    文件名称 : bsp_uart_fifo.c
*    版    本 : V2.0
*    说    明 : 采用串口中断+FIFO模式实现多个串口的同时访问。
*    修改记录 :
*        版本号  日期       作者    说明
*        V1.0    2013-02-01 armfly  正式发布
*        V1.1    2013-06-09 armfly  FiFo结构增加TxCount成员变量，方便判断缓冲区满; 增加 清FiFo的函数
*        V1.2    2014-09-29 armfly  增加RS485 MODBUS接口。接收到新字节后，直接执行回调函数。
*        V1.3    2015-07-23 armfly  增加 UART_T 结构的读写指针几个成员变量必须增加 __IO 修饰,否则优化后
*                    会导致串口发送函数死机。
*        V1.4    2015-08-04 armfly  解决UART4配置bug  GPIO_PinAFConfig(GPIOC, GPIO_PinSource11, GPIO_AF_USART1);
*        V1.5    2015-10-08 armfly  增加修改波特率的接口函数
*        V1.6    2018-09-07 armfly  移植到STM32H7平台
*        V1.7    2018-10-01 armfly  增加 Sending 标志，表示正在发送中
*        V1.8    2018-11-26 armfly  增加UART8，第8个串口
*        V1.9    2019-11-22 armfly  解决波特率低于2400时实际波特率错乱的BUG。 支持110 - 6M 波特率范围
*        V2.0    2019-11-23 armfly  支持串口硬件参数可读取，可单独修改。修改了 UART_T结构体成员.
*
*    Copyright (C), 2015-2030, 安富莱电子 www.armfly.com
*
*********************************************************************************************************
*/

#include "bsp.h"
#include "main.h"

#if UART1_FIFO_EN == 1
    /* 串口1的GPIO  PA9, PA10   RS323 DB9接口 */
    #define USART1_CLK_ENABLE()             __HAL_RCC_USART1_CLK_ENABLE()

    #define USART1_TX_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOA_CLK_ENABLE()
    #define USART1_TX_GPIO_PORT             GPIOA
    #define USART1_TX_PIN                   GPIO_PIN_9
    #define USART1_TX_AF                    GPIO_AF7_USART1

    #define USART1_RX_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOA_CLK_ENABLE()
    #define USART1_RX_GPIO_PORT             GPIOA   
    #define USART1_RX_PIN                   GPIO_PIN_10
    #define USART1_RX_AF                    GPIO_AF7_USART1
#endif

#if UART2_FIFO_EN == 1
    /* 串口2的GPIO --- PA2 PA3  GPS (只用RX。 TX被以太网占用） */
    #define USART2_CLK_ENABLE()             __HAL_RCC_USART2_CLK_ENABLE()

    #define USART2_TX_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOA_CLK_ENABLE()
    #define USART2_TX_GPIO_PORT             GPIOA
    #define USART2_TX_PIN                   GPIO_PIN_2
    #define USART2_TX_AF                    GPIO_AF7_USART2

    #define USART2_RX_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOA_CLK_ENABLE()
    #define USART2_RX_GPIO_PORT             GPIOA
    #define USART2_RX_PIN                   GPIO_PIN_3
    #define USART2_RX_AF                    GPIO_AF7_USART2
#endif

#if UART3_FIFO_EN == 1
    /* 串口3的GPIO --- PB10 PB11  RS485 */
    #define USART3_CLK_ENABLE()             __HAL_RCC_USART3_CLK_ENABLE()

    #define USART3_TX_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOB_CLK_ENABLE()
    #define USART3_TX_GPIO_PORT             GPIOB
    #define USART3_TX_PIN                   GPIO_PIN_10
    #define USART3_TX_AF                    GPIO_AF7_USART3

    #define USART3_RX_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOB_CLK_ENABLE()
    #define USART3_RX_GPIO_PORT             GPIOB
    #define USART3_RX_PIN                   GPIO_PIN_11
    #define USART3_RX_AF                    GPIO_AF7_USART3
#endif

#if UART4_FIFO_EN == 1
    /* 串口4的GPIO --- PH13 PH14 */
    #define UART4_CLK_ENABLE()              __HAL_RCC_UART4_CLK_ENABLE()

    #define UART4_TX_GPIO_CLK_ENABLE()      __HAL_RCC_GPIOH_CLK_ENABLE()
    #define UART4_TX_GPIO_PORT              GPIOH
    #define UART4_TX_PIN                    GPIO_PIN_13
    #define UART4_TX_AF                     GPIO_AF8_UART4

    #define UART4_RX_GPIO_CLK_ENABLE()      __HAL_RCC_GPIOH_CLK_ENABLE()
    #define UART4_RX_GPIO_PORT              GPIOH
    #define UART4_RX_PIN                    GPIO_PIN_14
    #define UART4_RX_AF                     GPIO_AF8_UART4
#endif

#if UART5_FIFO_EN == 1
    /* 串口5的GPIO --- PC12/UART5_TX PD2/UART5_RX (被SD卡占用） */
    #define UART5_CLK_ENABLE()              __HAL_RCC_UART5_CLK_ENABLE()

    #define UART5_TX_GPIO_CLK_ENABLE()      __HAL_RCC_GPIOC_CLK_ENABLE()
    #define UART5_TX_GPIO_PORT              GPIOC
    #define UART5_TX_PIN                    GPIO_PIN_12
    #define UART5_TX_AF                     GPIO_AF8_UART5

    #define UART5_RX_GPIO_CLK_ENABLE()      __HAL_RCC_GPIOD_CLK_ENABLE()
    #define UART5_RX_GPIO_PORT              GPIOD
    #define UART5_RX_PIN                    GPIO_PIN_2
    #define UART5_RX_AF                     GPIO_AF8_UART5
#endif

#if UART6_FIFO_EN == 1
    /* 串口6的GPIO --- PG14 PC7  GPRS */
    #define USART6_CLK_ENABLE()             __HAL_RCC_USART6_CLK_ENABLE()

    #define USART6_TX_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOG_CLK_ENABLE()
    #define USART6_TX_GPIO_PORT             GPIOG
    #define USART6_TX_PIN                   GPIO_PIN_14
    #define USART6_TX_AF                    GPIO_AF7_USART6

    #define USART6_RX_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOC_CLK_ENABLE()
    #define USART6_RX_GPIO_PORT             GPIOC
    #define USART6_RX_PIN                   GPIO_PIN_7
    #define USART6_RX_AF                    GPIO_AF7_USART6
#endif

#if UART7_FIFO_EN == 1
    /* 串口7的GPIO --- PA15  PA8 */
    #define UART7_CLK_ENABLE()              __HAL_RCC_UART7_CLK_ENABLE()

    #define UART7_TX_GPIO_CLK_ENABLE()      __HAL_RCC_GPIOA_CLK_ENABLE()
    #define UART7_TX_GPIO_PORT              GPIOA
    #define UART7_TX_PIN                    GPIO_PIN_15
    #define UART7_TX_AF                     GPIO_AF11_UART7

    #define UART7_RX_GPIO_CLK_ENABLE()      __HAL_RCC_GPIOA_CLK_ENABLE()
    #define UART7_RX_GPIO_PORT              GPIOA
    #define UART7_RX_PIN                    GPIO_PIN_8
    #define UART7_RX_AF                     GPIO_AF11_UART7
#endif

#if UART8_FIFO_EN == 1
    /* 串口8 只接收，不发送  PE0/UART8_RX */
    #define UART8_CLK_ENABLE()              __HAL_RCC_UART8_CLK_ENABLE()

//    #define UART8_TX_GPIO_CLK_ENABLE()      __HAL_RCC_GPIOJ_CLK_ENABLE()
//    #define UART8_TX_GPIO_PORT              GPIOJ
//    #define UART8_TX_PIN                    GPIO_PIN_8
//    #define UART8_TX_AF                     GPIO_AF8_UART8

    #define UART8_RX_GPIO_CLK_ENABLE()      __HAL_RCC_GPIOE_CLK_ENABLE()
    #define UART8_RX_GPIO_PORT              GPIOE
    #define UART8_RX_PIN                    GPIO_PIN_0
    #define UART8_RX_AF                     GPIO_AF8_UART8
#endif

/* 定义每个串口结构体变量 */
#if UART1_FIFO_EN == 1
static UART_T g_tUart1;
static uint8_t g_TxBuf1[UART1_TX_BUF_SIZE]; /* 发送缓冲区 */
static uint8_t g_RxBuf1[UART1_RX_BUF_SIZE]; /* 接收缓冲区 */
#endif

#if UART2_FIFO_EN == 1
static UART_T g_tUart2;
static uint8_t g_TxBuf2[UART2_TX_BUF_SIZE]; /* 发送缓冲区 */
static uint8_t g_RxBuf2[UART2_RX_BUF_SIZE]; /* 接收缓冲区 */
#endif

#if UART3_FIFO_EN == 1
static UART_T g_tUart3;
static uint8_t g_TxBuf3[UART3_TX_BUF_SIZE]; /* 发送缓冲区 */
static uint8_t g_RxBuf3[UART3_RX_BUF_SIZE]; /* 接收缓冲区 */
#endif

#if UART4_FIFO_EN == 1
static UART_T g_tUart4;
static uint8_t g_TxBuf4[UART4_TX_BUF_SIZE]; /* 发送缓冲区 */
static uint8_t g_RxBuf4[UART4_RX_BUF_SIZE]; /* 接收缓冲区 */
#endif

#if UART5_FIFO_EN == 1
static UART_T g_tUart5;
static uint8_t g_TxBuf5[UART5_TX_BUF_SIZE]; /* 发送缓冲区 */
static uint8_t g_RxBuf5[UART5_RX_BUF_SIZE]; /* 接收缓冲区 */
#endif

#if UART6_FIFO_EN == 1
static UART_T g_tUart6;
static uint8_t g_TxBuf6[UART6_TX_BUF_SIZE]; /* 发送缓冲区 */
static uint8_t g_RxBuf6[UART6_RX_BUF_SIZE]; /* 接收缓冲区 */
#endif

