armfly/H7-TOOL_STM32H7_App/User/bsp/src/bsp_uart_fifo.c
/*
*********************************************************************************************************
*    函 数 名: comGetChar
*    功能说明: 从接收缓冲区读取1字节，非阻塞。无论有无数据均立即返回。
*    形    参: _ucPort: 端口号(COM1 - COM5)
*              _pByte: 接收到的数据存放在这个地址
*    返 回 值: 0 表示无数据, 1 表示读取到有效字节
*********************************************************************************************************
*/
uint8_t comGetChar(COM_PORT_E _ucPort, uint8_t *_pByte)
{
    UART_T *pUart;

    pUart = ComToUart(_ucPort);
    if (pUart == 0)
    {
        return 0;
    }

    return UartGetChar(pUart, _pByte);
}

/*
*********************************************************************************************************
*    函 数 名: comClearTxFifo
*    功能说明: 清零串口发送缓冲区
*    形    参: _ucPort: 端口号(COM1 - COM6)
*    返 回 值: 无
*********************************************************************************************************
*/
void comClearTxFifo(COM_PORT_E _ucPort)
{
    UART_T *pUart;

    pUart = ComToUart(_ucPort);
    if (pUart == 0)
    {
        return;
    }

    pUart->usTxWrite = 0;
    pUart->usTxRead = 0;
    pUart->usTxCount = 0;
}

/*
*********************************************************************************************************
*    函 数 名: comClearRxFifo
*    功能说明: 清零串口接收缓冲区
*    形    参: _ucPort: 端口号(COM1 - COM6)
*    返 回 值: 无
*********************************************************************************************************
*/
void comClearRxFifo(COM_PORT_E _ucPort)
{
    UART_T *pUart;

    pUart = ComToUart(_ucPort);
    if (pUart == 0)
    {
        return;
    }

    pUart->usRxWrite = 0;
    pUart->usRxRead = 0;
    pUart->usRxCount = 0;
}

/*
*********************************************************************************************************
*    函 数 名: comGetBaud
*    功能说明: 读取串口的波特率
*    形    参: _ucPort: 端口号(COM1 - COM6)
*    返 回 值: 波特率
*********************************************************************************************************
*/
uint32_t comGetBaud(COM_PORT_E _ucPort)
{
    UART_T *pUart;

    pUart = ComToUart(_ucPort);
    if (pUart == 0)
    {
        return 0;
    }
    
    return pUart->huart.Init.BaudRate;
}

/*
*********************************************************************************************************
*    函 数 名: comSetBaud
*    功能说明: 设置串口的波特率. 本函数固定设置为无校验，收发都使能模式
*    形    参: _ucPort: 端口号(COM1 - COM5)
*              _BaudRate: 波特率，0-4500000， 最大4.5Mbps
*    返 回 值: 无
*********************************************************************************************************
*/
void comSetBaud(COM_PORT_E _ucPort, uint32_t _BaudRate)
{
    UART_T *pUart;

    pUart = ComToUart(_ucPort);
    if (pUart == 0)
    {
        return;
    }
    
    pUart->huart.Init.BaudRate = _BaudRate;
    
    if (pUart->huart.Init.BaudRate < 300)
    {
        pUart->huart.Init.ClockPrescaler = UART_PRESCALER_DIV64;
    }    
    else if (pUart->huart.Init.BaudRate < 1200)
    {
        pUart->huart.Init.ClockPrescaler = UART_PRESCALER_DIV8;
    }
    else if (pUart->huart.Init.BaudRate < 2400)
    {
        pUart->huart.Init.ClockPrescaler = UART_PRESCALER_DIV2;
    }
    else
    {
        pUart->huart.Init.ClockPrescaler = UART_PRESCALER_DIV1;
    }
        
    HAL_UART_Init(&pUart->huart);
}

/* 如果是RS485通信，请按如下格式编写函数， 我们仅举了 USART3作为RS485的例子 */

/*
*********************************************************************************************************
*    函 数 名: RS485_InitTXE
*    功能说明: 配置RS485发送使能口线 TXE
*    形    参: 无
*    返 回 值: 无
*********************************************************************************************************
*/
void RS485_InitTXE(void)
{
    GPIO_InitTypeDef gpio_init;

    /* 打开GPIO时钟 */
    RS485_TXEN_GPIO_CLK_ENABLE();

    /* 配置引脚为推挽输出 */
    gpio_init.Mode = GPIO_MODE_OUTPUT_PP;           /* 推挽输出 */
    gpio_init.Pull = GPIO_NOPULL;                   /* 上下拉电阻不使能 */
    gpio_init.Speed = GPIO_SPEED_FREQ_VERY_HIGH;    /* GPIO速度等级 */
    gpio_init.Pin = RS485_TXEN_PIN;
    HAL_GPIO_Init(RS485_TXEN_GPIO_PORT, &gpio_init);
}

/*
*********************************************************************************************************
*    函 数 名: RS485_SetBaud
*    功能说明: 修改485串口的波特率。
*    形    参: _baud : 波特率.0-4500000
*    返 回 值: 无
*********************************************************************************************************
*/
void RS485_SetBaud(uint32_t _baud)
{
    comSetBaud(COM3, _baud);
}

/*
*********************************************************************************************************
*    函 数 名: RS485_SendBefor
*    功能说明: 发送数据前的准备工作。对于RS485通信，请设置RS485芯片为发送状态，
*              并修改 UartVarInit()中的函数指针等于本函数名，比如 g_tUart2.SendBefor = RS485_SendBefor
*    形    参: 无
*    返 回 值: 无
*********************************************************************************************************
*/
void RS485_SendBefor(void)
{
    RS485_TX_EN(); /* 切换RS485收发芯片为发送模式 */
}

/*
*********************************************************************************************************
*    函 数 名: RS485_SendOver
*    功能说明: 发送一串数据结束后的善后处理。对于RS485通信，请设置RS485芯片为接收状态，
*              并修改 UartVarInit()中的函数指针等于本函数名，比如 g_tUart2.SendOver = RS485_SendOver
*    形    参: 无
*    返 回 值: 无
*********************************************************************************************************
*/
void RS485_SendOver(void)
{
    RS485_RX_EN(); /* 切换RS485收发芯片为接收模式 */
}

/*
*********************************************************************************************************
*    函 数 名: RS485_SendBuf
*    功能说明: 通过RS485芯片发送一串数据。注意，本函数不等待发送完毕。
*    形    参: _ucaBuf : 数据缓冲区
*              _usLen : 数据长度
*    返 回 值: 无
*********************************************************************************************************
*/
void RS485_SendBuf(uint8_t *_ucaBuf, uint16_t _usLen)
{
    comSendBuf(COM3, _ucaBuf, _usLen);
}

