armfly/H7-TOOL_STM32H7_App/User/bsp/src/bsp_uart_fifo.c
#if UART7_FIFO_EN == 1
    memset(&g_tUart7, 0, sizeof(UART_T));
    g_tUart7.huart.Instance = UART7;                        /* STM32 串口设备 */
    g_tUart7.pTxBuf = g_TxBuf7;                             /* 发送缓冲区指针 */
    g_tUart7.pRxBuf = g_RxBuf7;                             /* 接收缓冲区指针 */
    g_tUart7.usTxBufSize = UART7_TX_BUF_SIZE;               /* 发送缓冲区大小 */
    g_tUart7.usRxBufSize = UART7_RX_BUF_SIZE;               /* 接收缓冲区大小 */
    g_tUart7.usTxWrite = 0;                                 /* 发送FIFO写索引 */
    g_tUart7.usTxRead = 0;                                  /* 发送FIFO读索引 */
    g_tUart7.usRxWrite = 0;                                 /* 接收FIFO写索引 */
    g_tUart7.usRxRead = 0;                                  /* 接收FIFO读索引 */
    g_tUart7.usRxCount = 0;                                 /* 接收到的新数据个数 */
    g_tUart7.usTxCount = 0;                                 /* 待发送的数据个数 */
    g_tUart7.SendBefor = 0;                                 /* 发送数据前的回调函数 */
    g_tUart7.SendOver = 0;                                  /* 发送完毕后的回调函数 */
    g_tUart7.ReciveNew = 0;                                 /* 接收到新数据后的回调函数 */
    g_tUart7.Sending = 0;                                   /* 正在发送中标志 */
#endif

#if UART8_FIFO_EN == 1
    memset(&g_tUart8, 0, sizeof(UART_T));
    g_tUart8.huart.Instance = UART8;                        /* STM32 串口设备 */
    g_tUart8.pTxBuf = g_TxBuf8;                             /* 发送缓冲区指针 */
    g_tUart8.pRxBuf = g_RxBuf8;                             /* 接收缓冲区指针 */
    g_tUart8.usTxBufSize = UART8_TX_BUF_SIZE;               /* 发送缓冲区大小 */
    g_tUart8.usRxBufSize = UART8_RX_BUF_SIZE;               /* 接收缓冲区大小 */
    g_tUart8.usTxWrite = 0;                                 /* 发送FIFO写索引 */
    g_tUart8.usTxRead = 0;                                  /* 发送FIFO读索引 */
    g_tUart8.usRxWrite = 0;                                 /* 接收FIFO写索引 */
    g_tUart8.usRxRead = 0;                                  /* 接收FIFO读索引 */
    g_tUart8.usRxCount = 0;                                 /* 接收到的新数据个数 */
    g_tUart8.usTxCount = 0;                                 /* 待发送的数据个数 */
    g_tUart8.SendBefor = 0;                                 /* 发送数据前的回调函数 */
    g_tUart8.SendOver = 0;                                  /* 发送完毕后的回调函数 */
    g_tUart8.ReciveNew = 0;                                 /* 接收到新数据后的回调函数 */
    g_tUart8.Sending = 0;                                   /* 正在发送中标志 */
#endif

#if USB1_FIFO_EN == 1
    memset(&g_tUartUSB1, 0, sizeof(UART_T));
    g_tUartUSB1.huart.Instance = 0;                         /* 虚拟USB */
    g_tUartUSB1.pTxBuf = g_TxBufUSB1;                       /* 发送缓冲区指针 */
    g_tUartUSB1.pRxBuf = g_RxBufUSB1;                       /* 接收缓冲区指针 */
    g_tUartUSB1.usTxBufSize = USB1_TX_BUF_SIZE;             /* 发送缓冲区大小 */
    g_tUartUSB1.usRxBufSize = USB1_RX_BUF_SIZE;             /* 接收缓冲区大小 */
    g_tUartUSB1.usTxWrite = 0;                              /* 发送FIFO写索引 */
    g_tUartUSB1.usTxRead = 0;                               /* 发送FIFO读索引 */
    g_tUartUSB1.usRxWrite = 0;                              /* 接收FIFO写索引 */
    g_tUartUSB1.usRxCount = 0;                              /* 接收到的新数据个数 */
    g_tUartUSB1.usTxCount = 0;                              /* 待发送的数据个数 */
    g_tUartUSB1.SendBefor = 0;                              /* 发送数据前的回调函数 */
    g_tUartUSB1.SendOver = 0;                               /* 发送完毕后的回调函数 */
    g_tUartUSB1.ReciveNew = 0;                              /* 接收到新数据后的回调函数 */
    g_tUartUSB1.Sending = 0;                                /* 正在发送中标志 */
#endif

#if USB2_FIFO_EN == 1
    memset(&g_tUartUSB2, 0, sizeof(UART_T));
    g_tUartUSB2.huart.Instance = 0;                         /* 虚拟USB */
    g_tUartUSB2.pTxBuf = g_TxBufUSB2;                       /* 发送缓冲区指针 */
    g_tUartUSB2.pRxBuf = g_RxBufUSB2;                       /* 接收缓冲区指针 */
    g_tUartUSB2.usTxBufSize = USB2_TX_BUF_SIZE;             /* 发送缓冲区大小 */
    g_tUartUSB2.usRxBufSize = USB2_RX_BUF_SIZE;             /* 接收缓冲区大小 */
    g_tUartUSB2.usTxWrite = 0;                              /* 发送FIFO写索引 */
    g_tUartUSB2.usTxRead = 0;                               /* 发送FIFO读索引 */
    g_tUartUSB2.usRxWrite = 0;                              /* 接收FIFO写索引 */
    g_tUartUSB2.usRxCount = 0;                              /* 接收到的新数据个数 */
    g_tUartUSB2.usTxCount = 0;                              /* 待发送的数据个数 */
    g_tUartUSB2.SendBefor = 0;                              /* 发送数据前的回调函数 */
    g_tUartUSB2.SendOver = 0;                               /* 发送完毕后的回调函数 */
    g_tUartUSB2.ReciveNew = 0;                              /* 接收到新数据后的回调函数 */
    g_tUartUSB2.Sending = 0;                                /* 正在发送中标志 */
#endif
}

/*
*********************************************************************************************************
*    函 数 名: bsp_InitUartParam
*    功能说明: 配置串口的硬件参数（波特率，数据位，停止位)
*    形    参: 无
*    返 回 值: 无
*********************************************************************************************************
*/
void bsp_InitUartParam(COM_PORT_E _ucPort, uint32_t BaudRate, uint32_t Parity, uint32_t Mode)
{
    UART_T *pUart;

    pUart = ComToUart(_ucPort);
    if (pUart == 0)
    {
        return;
    }

    /* 配置串口硬件参数 */
    /*##-1- Configure the UART peripheral ######################################*/
    /* Put the USART peripheral in the Asynchronous mode (UART Mode) */
    /* UART configured as follows:
      - Word Length = 8 Bits (7 data bit + 1 parity bit) : 
                      BE CAREFUL : Program 7 data bits + 1 parity bit in PC HyperTerminal
      - Stop Bit    = One Stop bit
      - Parity      = ODD parity
      - BaudRate    = 9600 baud
      - Hardware flow control disabled (RTS and CTS signals) */
    pUart->huart.Init.BaudRate = BaudRate;
    pUart->huart.Init.WordLength = UART_WORDLENGTH_8B;
    pUart->huart.Init.StopBits = UART_STOPBITS_1;
    pUart->huart.Init.Parity = Parity;
    pUart->huart.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    pUart->huart.Init.Mode = Mode;
    pUart->huart.Init.OverSampling = UART_OVERSAMPLING_16;
    pUart->huart.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;  
    if (BaudRate < 300)
    {
        pUart->huart.Init.ClockPrescaler = UART_PRESCALER_DIV64;
    }    
    else if (BaudRate < 1200)
    {
        pUart->huart.Init.ClockPrescaler = UART_PRESCALER_DIV8;
    }
    else if (BaudRate < 2400)
    {
        pUart->huart.Init.ClockPrescaler = UART_PRESCALER_DIV2;
    }
    else
    {
        pUart->huart.Init.ClockPrescaler = UART_PRESCALER_DIV1;
    }
    pUart->huart.FifoMode = UART_FIFOMODE_DISABLE;
    pUart->huart.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;
        
    if (HAL_UART_Init(&pUart->huart) != HAL_OK)
    {
        /* Initialization Error */
        Error_Handler(__FILE__, __LINE__);
    }
}

