armfly/H7-TOOL_STM32H7_App/User/bsp/src/bsp_uart_fifo.c
        /* 改写FIFO读索引 */
        DISABLE_INT();
        if (++_pUart->usRxRead >= _pUart->usRxBufSize)
        {
            _pUart->usRxRead = 0;
        }
        _pUart->usRxCount--;
        ENABLE_INT();
        return 1;
    }
}

/*
*********************************************************************************************************
*   函 数 名: comTxEmpty
*   功能说明: 判断发送缓冲区是否为空。
*   形    参:  _pUart : 串口设备
*   返 回 值: 1为空。0为不空。
*********************************************************************************************************
*/
uint8_t comTxEmpty(COM_PORT_E _ucPort)
{
    UART_T *pUart;
    uint8_t Sending;

    pUart = ComToUart(_ucPort);
    if (pUart == 0)
    {
        return 0;
    }

    Sending = pUart->Sending;

    if (Sending != 0)
    {
        return 0;
    }
    return 1;
}

/*
*********************************************************************************************************
*    函 数 名: comPutRxFifo
*    功能说明: 软件向接收FIFO填充数据
*    形    参: _ucPort : 串口设备
*    返 回 值: 无
*********************************************************************************************************
*/
void comPutRxFifo(COM_PORT_E _ucPort, uint8_t *_buf, uint16_t _len)
{
    UART_T *pUart;
    uint16_t i;

    pUart = ComToUart(_ucPort);
    if (pUart == 0)
    {
        return;
    }

    for (i = 0; i < _len; i++)
    {
        pUart->pRxBuf[pUart->usRxWrite] = _buf[i];
        if (++pUart->usRxWrite >= pUart->usRxBufSize)
        {
            pUart->usRxWrite = 0;
        }
        if (pUart->usRxCount < pUart->usRxBufSize)
        {
            pUart->usRxCount++;
        }
    }
}

/*
*********************************************************************************************************
*    函 数 名: UartIRQ
*    功能说明: 供中断服务程序调用，通用串口中断处理函数
*    形    参: _pUart : 串口设备
*    返 回 值: 无
*********************************************************************************************************
*/
void UartIRQ(UART_T *_pUart)
{
    uint32_t isrflags = READ_REG(_pUart->huart.Instance->ISR);
    uint32_t cr1its = READ_REG(_pUart->huart.Instance->CR1);
    uint32_t cr3its = READ_REG(_pUart->huart.Instance->CR3);

    /* 处理接收中断  */
    if ((isrflags & USART_ISR_RXNE_RXFNE) != RESET)
    {
        /* 从串口接收数据寄存器读取数据存放到接收FIFO */
        uint8_t ch;

        ch = READ_REG(_pUart->huart.Instance->RDR);
        _pUart->pRxBuf[_pUart->usRxWrite] = ch;
        if (++_pUart->usRxWrite >= _pUart->usRxBufSize)
        {
            _pUart->usRxWrite = 0;
        }
        if (_pUart->usRxCount < _pUart->usRxBufSize)
        {
            _pUart->usRxCount++;
        }

        /* 回调函数,通知应用程序收到新数据,一般是发送1个消息或者设置一个标记 */
        //if (_pUart->usRxWrite == _pUart->usRxRead)
        //if (_pUart->usRxCount == 1)
        {
            if (_pUart->ReciveNew)
            {
                _pUart->ReciveNew(ch);
            }
        }
    }

    /* 处理发送缓冲区空中断 */
    if (((isrflags & USART_ISR_TXE_TXFNF) != RESET) && (cr1its & USART_CR1_TXEIE) != RESET)
    {
        //if (_pUart->usTxRead == _pUart->usTxWrite)
        if (_pUart->usTxCount == 0)
        {
            /* 发送缓冲区的数据已取完时， 禁止发送缓冲区空中断 （注意：此时最后1个数据还未真正发送完毕）*/
            //USART_ITConfig(_pUart->uart, USART_IT_TXE, DISABLE);
            CLEAR_BIT(_pUart->huart.Instance->CR1, USART_CR1_TXEIE);

            /* 使能数据发送完毕中断 */
            //USART_ITConfig(_pUart->uart, USART_IT_TC, ENABLE);
            SET_BIT(_pUart->huart.Instance->CR1, USART_CR1_TCIE);
        }
        else
        {
            _pUart->Sending = 1;

            /* 从发送FIFO取1个字节写入串口发送数据寄存器 */
            //USART_SendData(_pUart->uart, _pUart->pTxBuf[_pUart->usTxRead]);
            _pUart->huart.Instance->TDR = _pUart->pTxBuf[_pUart->usTxRead];
            if (++_pUart->usTxRead >= _pUart->usTxBufSize)
            {
                _pUart->usTxRead = 0;
            }
            _pUart->usTxCount--;
        }
    }
    /* 数据bit位全部发送完毕的中断 */
    if (((isrflags & USART_ISR_TC) != RESET) && ((cr1its & USART_CR1_TCIE) != RESET))
    {
        //if (_pUart->usTxRead == _pUart->usTxWrite)
        if (_pUart->usTxCount == 0)
        {
            /* 如果发送FIFO的数据全部发送完毕，禁止数据发送完毕中断 */
            //USART_ITConfig(_pUart->uart, USART_IT_TC, DISABLE);
            CLEAR_BIT(_pUart->huart.Instance->CR1, USART_CR1_TCIE);

            /* 回调函数, 一般用来处理RS485通信，将RS485芯片设置为接收模式，避免抢占总线 */
            if (_pUart->SendOver)
            {
                _pUart->SendOver();
            }

            _pUart->Sending = 0;
        }
        else
        {
            /* 正常情况下，不会进入此分支 */

            /* 如果发送FIFO的数据还未完毕，则从发送FIFO取1个数据写入发送数据寄存器 */
            //USART_SendData(_pUart->uart, _pUart->pTxBuf[_pUart->usTxRead]);
            _pUart->huart.Instance->TDR = _pUart->pTxBuf[_pUart->usTxRead];
            if (++_pUart->usTxRead >= _pUart->usTxBufSize)
            {
                _pUart->usTxRead = 0;
            }
            _pUart->usTxCount--;
        }
    }

    /* 清除中断标志 */
    SET_BIT(_pUart->huart.Instance->ICR, UART_CLEAR_PEF);
    SET_BIT(_pUart->huart.Instance->ICR, UART_CLEAR_FEF);
    SET_BIT(_pUart->huart.Instance->ICR, UART_CLEAR_NEF);
    SET_BIT(_pUart->huart.Instance->ICR, UART_CLEAR_OREF);
    SET_BIT(_pUart->huart.Instance->ICR, UART_CLEAR_IDLEF);
    SET_BIT(_pUart->huart.Instance->ICR, UART_CLEAR_TCF);
    SET_BIT(_pUart->huart.Instance->ICR, UART_CLEAR_LBDF);
    SET_BIT(_pUart->huart.Instance->ICR, UART_CLEAR_CTSF);
    SET_BIT(_pUart->huart.Instance->ICR, UART_CLEAR_CMF);
    SET_BIT(_pUart->huart.Instance->ICR, UART_CLEAR_WUF);
    SET_BIT(_pUart->huart.Instance->ICR, UART_CLEAR_TXFECF);

    //      *            @arg UART_CLEAR_PEF: Parity Error Clear Flag
    //  *            @arg UART_CLEAR_FEF: Framing Error Clear Flag
    //  *            @arg UART_CLEAR_NEF: Noise detected Clear Flag
    //  *            @arg UART_CLEAR_OREF: OverRun Error Clear Flag
    //  *            @arg UART_CLEAR_IDLEF: IDLE line detected Clear Flag
    //  *            @arg UART_CLEAR_TCF: Transmission Complete Clear Flag
    //  *            @arg UART_CLEAR_LBDF: LIN Break Detection Clear Flag
    //  *            @arg UART_CLEAR_CTSF: CTS Interrupt Clear Flag
    //  *            @arg UART_CLEAR_RTOF: Receiver Time Out Clear Flag
    //  *            @arg UART_CLEAR_CMF: Character Match Clear Flag
    //  *            @arg.UART_CLEAR_WUF:  Wake Up from stop mode Clear Flag
    //  *            @arg UART_CLEAR_TXFECF: TXFIFO empty Clear Flag
}

