armfly/H7-TOOL_STM32H7_App/User/bsp/src/bsp_uart_fifo.c
/*
*********************************************************************************************************
*    函 数 名: USART1_IRQHandler  USART2_IRQHandler USART3_IRQHandler UART4_IRQHandler UART5_IRQHandler
*    功能说明: USART中断服务程序
*    形    参: 无
*    返 回 值: 无
*********************************************************************************************************
*/
#if UART1_FIFO_EN == 1
void USART1_IRQHandler(void)
{
    UartIRQ(&g_tUart1);
}
#endif

#if UART2_FIFO_EN == 1
void USART2_IRQHandler(void)
{
    UartIRQ(&g_tUart2);
}
#endif

#if UART3_FIFO_EN == 1
void USART3_IRQHandler(void)
{
    UartIRQ(&g_tUart3);
}
#endif

#if UART4_FIFO_EN == 1
void UART4_IRQHandler(void)
{
    UartIRQ(&g_tUart4);
}
#endif

#if UART5_FIFO_EN == 1
void UART5_IRQHandler(void)
{
    UartIRQ(&g_tUart5);
}
#endif

#if UART6_FIFO_EN == 1
void USART6_IRQHandler(void)
{
    UartIRQ(&g_tUart6);
}
#endif

#if UART7_FIFO_EN == 1
void UART7_IRQHandler(void)
{
    UartIRQ(&g_tUart7);
}
#endif

#if UART8_FIFO_EN == 1
void UART8_IRQHandler(void)
{
    UartIRQ(&g_tUart8);
}
#endif

/*
*********************************************************************************************************
*    函 数 名: fputc
*    功能说明: 重定义putc函数，这样可以使用printf函数从串口1打印输出
*    形    参: 无
*    返 回 值: 无
*********************************************************************************************************
*/
extern uint8_t USBCom_SendBuf(int _Port, uint8_t *_Buf, uint16_t _Len);
extern void lua_udp_SendBuf(uint8_t *_buf, uint16_t _len, uint16_t _port);
extern MEMO_T g_LuaMemo;
extern uint16_t g_MainStatus;
int fputc(int ch, FILE *f)
{
    uint8_t buf[1];

    buf[0] = ch;
    
#if PRINT_TO_UDP == 1
    lua_udp_SendBuf(buf, 1, LUA_UDP_PORT);
    
    if (g_MainStatus == MS_LUA_EXEC_FILE)
    {
        LCD_MemoAddChar(&g_LuaMemo, ch);
    }
#else
    USBCom_SendBuf(1, buf, 1);
#endif
	
    //comSendChar(COM1, ch);
    return ch;
}

/*
*********************************************************************************************************
*    函 数 名: fgetc
*    功能说明: 重定义getc函数，这样可以使用getchar函数从串口1输入数据
*    形    参: 无
*    返 回 值: 无
*********************************************************************************************************
*/
int fgetc(FILE *f)
{
    //#if 1    /* 从串口接收FIFO中取1个数据, 只有取到数据才返回 */
    //    uint8_t ucData;

    //    while(comGetChar(COM1, &ucData) == 0);

    //    return ucData;
    //#else
    //    /* 等待串口1输入数据 */
    //    while (USART_GetFlagStatus(USART1, USART_FLAG_RXNE) == RESET);

    //    return (int)USART_ReceiveData(USART1);
    //#endif
    return 0;
}
    
/***************************** 安富莱电子 www.armfly.com (END OF FILE) *********************************/
